function [Rinv] = Inverse_R_GR(R)

        Rinv = zeros(4);
        n = length(R);
%-----------------------------------------------------------------------------------------------

    for i = n:-1:1
        Rinv(i, i) = 1/R(i, i);   % Вычисление элементов стоящих на главной диагонали матрицы R
    end   
%-----------------------------------------------------------------------------------------------

    for i = n-1:-1:1
        Rinv(i, i+1) = -R(i, i+1) * Rinv(i+1, i+1) / R(i, i);   
        % Вычисление элементов стоящих над главной диагональю матрицы R по диагонали
        % В индексах это элементы R(1, 2) R(2, 3) R(3, 4)
    end 
%-----------------------------------------------------------------------------------------------

    for i = n-2:-1:1
        Rinv(i, i+2) = -(R(i, i+1)*Rinv(i+1, i+2) + R(i, i+2)*Rinv(i+2, i+2)) / R(i,i);
        % Аналогично следуюущие два элемента выше по диагонали R(1, 3) R(2, 4)
    end
%-----------------------------------------------------------------------------------------------

        Rinv(1, 4) = -(R(1, 2)*Rinv(2, 4) + R(1, 3)*Rinv(3, 4) + R(1, 4)*Rinv(4, 4)) / R(1, 1);
        % Вычисление последнего элемента R(1, 4)
end



















